{
  "hidden_size": 64,
  "image_token_id": 151655,
  "intermediate_size": 128,
  "model_type": "qwen2_5_vl",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "text_config": {
    "attention_dropout": 0.0,
    "hidden_act": "silu",
    "hidden_size": 64,
    "initializer_range": 0.02,
    "intermediate_size": 128,
    "layer_types": [
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 32768,
    "max_window_layers": 80,
    "model_type": "qwen2_5_vl_text",
    "num_attention_heads": 4,
    "num_hidden_layers": 2,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 1000
  },
  "transformers_version": "4.57.5",
  "video_token_id": 151656,
  "vision_config": {
    "depth": 32,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 3584,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 3420,
    "model_type": "qwen2_5_vl",
    "num_heads": 16,
    "out_hidden_size": 3584,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2,
    "tokens_per_second": 4,
    "window_size": 112
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vocab_size": 1000
}